УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромMAX/CRM_РаботаСМессенджеромMAX.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромMAX</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиБота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресWebhook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СекретWebhook</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Провайдер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ApiURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MediaURL</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромMAX/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбязательныеМетодыПрограмногоИнтерфейса

Функция ПолучитьСообщения(УчетнаяЗапись) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		Возврат ПолучитьСообщенияGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
	КонецЕсли;
	
	МассивСообщений = Новый Массив;
	
	// Без marker API возвращает только последнее обновление - храним маркер между опросами.
	Ресурс = URLМетода("updates") + ПараметрыОбновлений(УчетнаяЗапись);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ВыполнитьЗапросMAX(
		Ресурс, , СтруктураПараметровДоступа));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("updates") Тогда
		ЗаполнитьСообщенияИзОбновлений(УчетнаяЗапись, СтруктураОтвета.updates, МассивСообщений);
		СохранитьМаркерОбновлений(УчетнаяЗапись, СтруктураОтвета);
	КонецЕсли;
	
	Возврат МассивСообщений;
	
КонецФункции

Функция ОтправитьСообщение(Сообщение, УчетнаяЗапись, IDПользователя, СписокФайлов, ДопПараметры) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		Возврат ОтправитьСообщениеGreen(Сообщение, УчетнаяЗапись, IDПользователя,
			СписокФайлов, СтруктураПараметровДоступа);
	КонецЕсли;
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("text", Сообщение);
	
	Если СписокФайлов <> Неопределено И СписокФайлов.Количество() > 0 Тогда
		МассивВложений = Новый Массив;
		Для каждого Вложение Из СписокФайлов Цикл
			ДанныеВложения = Вложение.Значение;
			Если ТипЗнч(ДанныеВложения) = Тип("ДвоичныеДанные") Тогда
				ТипВложения = ТипВложенияПоРасширению(Вложение.Представление);
				ТокенВложения = ЗагрузитьВложениеMAX(ДанныеВложения, Вложение.Представление,
					ТипВложения, СтруктураПараметровДоступа);
				Если ЗначениеЗаполнено(ТокенВложения) Тогда
					ВложениеMAX = Новый Структура("type, payload", ТипВложения,
						Новый Структура("token", ТокенВложения));
					МассивВложений.Добавить(ВложениеMAX);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Если МассивВложений.Количество() > 0 Тогда
			ДанныеЗапроса.Вставить("attachments", МассивВложений);
		КонецЕсли;
	КонецЕсли;
	
	Ресурс = URLМетода("messages");
	Если ЗначениеЗаполнено(IDПользователя) Тогда
		Ресурс = Ресурс + "?user_id=" + IDПользователя;
	КонецЕсли;
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ВыполнитьЗапросMAX(
		Ресурс, СтрокаЗапроса, СтруктураПараметровДоступа));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("message")
		И СтруктураОтвета.message.Свойство("body")
		И СтруктураОтвета.message.body.Свойство("mid") Тогда
		Возврат СтруктураОтвета.message.body.mid;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ОжиданиеСобытий(УчетнаяЗапись, ОднаИтерация = Ложь) Экспорт
	
	// MAX получает события через Long Polling (GET /updates) либо Webhook.
	// Long Polling используется как резервный способ получения обновлений
	// для учётных записей без настроенного Webhook.
	// Для Green-API — через receiveNotification / webhook Green.
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураПараметровДоступа.Свойство("ИспользоватьWebhook")
		И СтруктураПараметровДоступа.ИспользоватьWebhook Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		ОжиданиеСобытийGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
		Возврат;
	КонецЕсли;
	
	МассивСообщений = Новый Массив;
	// Без marker API возвращает только последнее обновление - храним маркер между опросами.
	Ресурс = URLМетода("updates") + ПараметрыОбновлений(УчетнаяЗапись);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ВыполнитьЗапросMAX(
		Ресурс, , СтруктураПараметровДоступа));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
	Если СтруктураОтвета.Свойство("updates") Тогда
		ЗаполнитьСообщенияИзОбновлений(УчетнаяЗапись, СтруктураОтвета.updates, МассивСообщений);
		Если МассивСообщений.Количество() > 0 Тогда
			CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
		КонецЕсли;
		СохранитьМаркерОбновлений(УчетнаяЗапись, СтруктураОтвета);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьВидКИМессенджера(Контакт) Экспорт
	
	Наименование = "MAX";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	                      |	ВидыКонтактнойИнформации.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Наименование = &Наименование
	                      |	И ВидыКонтактнойИнформации.Тип = &Тип
	                      |	И ВидыКонтактнойИнформации.Родитель = &Родитель");
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты;
	КонецЕсли;
	
	ТипКИ = ТипКИМессенджера();
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Тип", ТипКИ);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйВидКИ.Родитель = Родитель;
		НовыйВидКИ.Наименование = Наименование;
		НовыйВидКИ.Тип = ТипКИ;
		НовыйВидКИ.Используется = Истина;
		НовыйВидКИ.ВидРедактирования = "Диалог";
		НовыйВидКИ.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НовыйВидКИ.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ТипКИМессенджера() Экспорт
	
	Возврат Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	
КонецФункции

Функция НачалоАдресаСтраницыПользователя() Экспорт
	Возврат "";
КонецФункции

Функция ПутьКДиалогуВБраузере(Структура) Экспорт
	Возврат "";
КонецФункции

Функция ПредставлениеКонтактнойИнформацииПользователя(ID_Пользователя) Экспорт
	Возврат ID_Пользователя;
КонецФункции

Функция ВозможноИзменениеСообщений() Экспорт
	Возврат Ложь; 
КонецФункции

Функция ИспользуютсяВложения() Экспорт
	Возврат Истина; 
КонецФункции

Функция HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы) Экспорт
	Возврат Неопределено; 
КонецФункции

Функция Отключиться(СтруктураПараметровДоступа) Экспорт
	
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		Возврат ОтключитьсяGreen(СтруктураПараметровДоступа);
	КонецЕсли;
	
	// MAX не предоставляет метода отключения бота через API.
	// Для отключения достаточно удалить подписку на Webhook (если она была).
	Если СтруктураПараметровДоступа.Свойство("ИспользоватьWebhook")
		И СтруктураПараметровДоступа.ИспользоватьWebhook Тогда
		Если СтруктураПараметровДоступа.Свойство("АдресWebhook")
			И ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
			Ресурс = URLМетода("subscriptions") + "?url=" + КодироватьСтроку(
				СтруктураПараметровДоступа.АдресWebhook, СпособКодированияСтроки.КодировкаURL);
			Попытка
				ВыполнитьЗапросMAX(Ресурс, , СтруктураПараметровДоступа, Истина);
			Исключение
				ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.Отключиться",
					УровеньЖурналаРегистрации.Предупреждение, , ,
					"Не удалось удалить подписку на Webhook: " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Процедура ПометитьКакПрочтенные(УчетнаяЗапись, МассивСообщений) Экспорт
	
	// API MAX не предоставляет метода отметки сообщений как прочитанных.
	
КонецПроцедуры

Функция ОбработатьWebhook(УчетнаяЗапись, ТелоЗапроса) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		ДанныеОтвета = Новый Структура("error", "Сервис не найден!");
		Ответ = CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
		Возврат Ответ; 
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		Возврат ОбработатьWebhookGreen(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа);
	КонецЕсли;
	
	Оповещение = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ТелоЗапроса);
	
	Если Оповещение.Свойство("update_type") И Оповещение.update_type = "message_created"
		И Оповещение.Свойство("message") Тогда
		МассивСообщений = Новый Массив;
		Сообщение = СообщениеИзДанныхMAX(УчетнаяЗапись, Оповещение.message);
		Если Сообщение <> Неопределено Тогда
			МассивСообщений.Добавить(Сообщение);
		КонецЕсли;
		Если МассивСообщений.Количество() > 0 Тогда
			CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура("status", "ок");
	Ответ = CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
	Возврат Ответ;
	
КонецФункции

Функция УстановитьWebhook(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ЭтоПровайдерGreen(СтруктураПараметровДоступа) Тогда
		Возврат УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа);
	КонецЕсли;
	
	Если Не СтруктураПараметровДоступа.Свойство("АдресWebhook")
		Или Не ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
	АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/")
		+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("url", АдресWebhook);
	МассивТиповСобытий = Новый Массив;
	МассивТиповСобытий.Добавить("message_created");
	// message_edited не запрашиваем: изменения сообщений не поддерживаются (ВозможноИзменениеСообщений = Ложь).
	МассивТиповСобытий.Добавить("bot_started");
	ДанныеЗапроса.Вставить("update_types", МассивТиповСобытий);
	Если СтруктураПараметровДоступа.Свойство("СекретWebhook")
		И ЗначениеЗаполнено(СтруктураПараметровДоступа.СекретWebhook) Тогда
		ДанныеЗапроса.Вставить("secret", СтруктураПараметровДоступа.СекретWebhook);
	КонецЕсли;
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ВыполнитьЗапросMAX(
		URLМетода("subscriptions"), СтрокаЗапроса, СтруктураПараметровДоступа));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
	// При ошибке подписки API возвращает код 200 и success = false.
	Если СтруктураОтвета.Свойство("success") И Не СтруктураОтвета.success Тогда
		СообщениеОбОшибке = ?(СтруктураОтвета.Свойство("message"), СтруктураОтвета.message,
			"Не удалось установить подписку на Webhook");
		ВызватьИсключение СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат Истина;
КонецФункции

Функция ПользовательДоступен(УчетнаяЗапись, ДополнительныеДанные) Экспорт
	
	Результат = Новый Структура("Доступен, Описание", Ложь, "");
	Возврат Результат;
	
КонецФункции

Функция ПараметрыМессенджера() Экспорт
	
    ПараметрыМессенджера = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровМессенджера();
	
	Возврат ПараметрыМессенджера;
	
КонецФункции

#КонецОбласти

Процедура ПроверитьПодключение(ПараметрыПроверки, ПараметрыПрокси) Экспорт
	
	СтруктураПараметровДоступа = Новый Структура;
	СтруктураПараметровДоступа.Вставить("Токен", ПараметрыПроверки.Токен);
	СтруктураПараметровДоступа.Вставить("ПараметрыПрокси", ПараметрыПрокси);
	
	Если ПараметрыПроверки.Свойство("Провайдер") И ПараметрыПроверки.Провайдер = 1 Тогда
		СтруктураПараметровДоступа.Вставить("Провайдер", 1);
		СтруктураПараметровДоступа.Вставить("ApiURL", ПараметрыПроверки.ApiURL);
		СтруктураПараметровДоступа.Вставить("Сервер", ПараметрыПроверки.Сервер);
		ПроверитьПодключениеGreen(СтруктураПараметровДоступа);
		Возврат;
	КонецЕсли;
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ВыполнитьЗапросMAX(
		URLМетода("me"), , СтруктураПараметровДоступа));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает Истина, если учётная запись работает через Green-API.
//
// Параметры:
//  СтруктураПараметровДоступа - Структура - Параметры доступа учётной записи.
//
// Возвращаемое значение:
//  Булево - Признак провайдера Green-API.
//
Функция ЭтоПровайдерGreen(СтруктураПараметровДоступа)
	
	Возврат ТипЗнч(СтруктураПараметровДоступа) = Тип("Структура")
		И СтруктураПараметровДоступа.Свойство("Провайдер")
		И СтруктураПараметровДоступа.Провайдер = 1;
	
КонецФункции


// Возвращает настроенный интернет-прокси из параметров доступа.
//
// Параметры:
//  СтруктураПараметровДоступа - Структура - Параметры доступа (содержит ПараметрыПрокси).
//
// Возвращаемое значение:
//  ИнтернетПрокси, Неопределено - Прокси для HTTP-соединения.
//
Функция ПроксиМессенджера(СтруктураПараметровДоступа)
	
	Если ТипЗнч(СтруктураПараметровДоступа) = Тип("Структура")
		И СтруктураПараметровДоступа.Свойство("ПараметрыПрокси")
		И СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
		
		ПараметрыПрокси = СтруктураПараметровДоступа.ПараметрыПрокси;
		HTTPПрокси = Новый ИнтернетПрокси;
		HTTPПрокси.Установить("https", ПараметрыПрокси.Сервер, ПараметрыПрокси.Порт,
			ПараметрыПрокси.Пользователь, ПараметрыПрокси.Пароль, Ложь);
		Возврат HTTPПрокси;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Выполняет запрос к API MAX.
//
// Параметры:
//  Ресурс			   - Строка - Ресурс (относительный путь метода API).
//  СтрокаЗапроса	   - Строка - Строка запроса (тело JSON).
//  СтруктураПараметровДоступа - Структура - Параметры доступа (содержит Токен и ПараметрыПрокси).
//  Удаление			   - Булево - Признак использования HTTP-метода DELETE.
//
// Возвращаемое значение:
//  Строка - Текст ответа сервера.
//
Функция ВыполнитьЗапросMAX(Ресурс, СтрокаЗапроса = "", СтруктураПараметровДоступа, Удаление = Ложь)
	
	HTTPПрокси = ПроксиМессенджера(СтруктураПараметровДоступа);
	
	HTTPСоединение = Новый HTTPСоединение(СерверMAX(), , , , HTTPПрокси, 30, Новый ЗащищенноеСоединениеOpenSSL);
	
	ЗаголовокHTTP = Новый Соответствие;
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	Если СтруктураПараметровДоступа.Свойство("Токен") И ЗначениеЗаполнено(СтруктураПараметровДоступа.Токен) Тогда
		ЗаголовокHTTP.Вставить("Authorization", СтруктураПараметровДоступа.Токен);
	КонецЕсли;
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс, ЗаголовокHTTP);
	Если Удаление Тогда
		Ответ = HTTPСоединение.Удалить(HTTPЗапрос);
	ИначеЕсли ЗначениеЗаполнено(СтрокаЗапроса) Тогда
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаЗапроса, "UTF-8", ИспользованиеByteOrderMark.НеИспользовать);
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	Иначе
		Ответ = HTTPСоединение.Получить(HTTPЗапрос);
	КонецЕсли;
	
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстОтвета = ПолучитьТекстОшибки(ТекстОтвета, Ответ.КодСостояния);
	КонецЕсли;
	
	Возврат ТекстОтвета;
	
КонецФункции

// Загружает вложение в MAX и возвращает токен файла.
//
// Параметры:
//  Данные			   - ДвоичныеДанные - Данные файла.
//  ИмяФайла			   - Строка - Имя файла с расширением.
//  ТипВложения		   - Строка - Тип вложения (image, video, audio, file).
//  СтруктураПараметровДоступа - Структура - Параметры доступа.
//
// Возвращаемое значение:
//  Строка - Токен загруженного файла.
//
Функция ЗагрузитьВложениеMAX(Данные, ИмяФайла, ТипВложения, СтруктураПараметровДоступа)
	
	ТокенФайла = "";
	
	Попытка
		// Шаг 1. Получение URL для загрузки файла: POST /uploads?type=<тип>.
		HTTPСоединение = Новый HTTPСоединение(СерверMAX(), , , , ПроксиМессенджера(СтруктураПараметровДоступа), 60,
			Новый ЗащищенноеСоединениеOpenSSL);
		
		ЗаголовокHTTP = Новый Соответствие;
		Если СтруктураПараметровДоступа.Свойство("Токен") И ЗначениеЗаполнено(СтруктураПараметровДоступа.Токен) Тогда
			ЗаголовокHTTP.Вставить("Authorization", СтруктураПараметровДоступа.Токен);
		КонецЕсли;
		
		HTTPЗапрос = Новый HTTPЗапрос(URLМетода("uploads") + "?type=" + ТипВложения, ЗаголовокHTTP);
		Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(Ответ.ПолучитьТелоКакСтроку());
		Если СтруктураОтвета.Свойство("error") Тогда
			ВызватьИсключение СтруктураОтвета.error;
		ИначеЕсли Не СтруктураОтвета.Свойство("url") Тогда
			ВызватьИсключение "Не получен URL для загрузки вложения";
		КонецЕсли;
		
		URLЗагрузки = СтруктураОтвета.url;
		// Для video/audio MAX возвращает токен уже на этом шаге.
		ТокенИзОтветаНаЗагрузку = ?(СтруктураОтвета.Свойство("token"), СтруктураОтвета.token, "");
		
		// Шаг 2. Загрузка файла по полученному URL: multipart/form-data, поле "data".
		ЧастиURL = РазбитьURL(URLЗагрузки);
		СоединениеФайла = Новый HTTPСоединение(ЧастиURL.Хост, , , ,
			ПроксиМессенджера(СтруктураПараметровДоступа), 60, Новый ЗащищенноеСоединениеOpenSSL);
		
		ГраницаЧасти = "----SmartUTBoundary" + Строка(Новый УникальныйИдентификатор());
		ЗаголовочнаяЧасть = "--" + ГраницаЧасти + Символы.ПС
			+ "Content-Disposition: form-data; name=""data""; filename=""" + ИмяФайла + """" + Символы.ПС
			+ "Content-Type: application/octet-stream" + Символы.ПС + Символы.ПС;
		ЗаключительнаяЧасть = Символы.ПС + "--" + ГраницаЧасти + "--" + Символы.ПС;
		
		// Тело собирается через двоичный поток - файл передается байтами без искажения.
		ПотокТела = Новый ПотокВПамяти;
		ЗаписьТела = Новый ЗаписьДанных(ПотокТела);
		ЗаписьТела.Записать(БуферВДвоичныеДанные(ЗаголовочнаяЧасть));
		ЗаписьТела.Записать(Данные);
		ЗаписьТела.Записать(БуферВДвоичныеДанные(ЗаключительнаяЧасть));
		ЗаписьТела.Закрыть();
		ТелоЗапроса = ПотокТела.ЗакрытьИПолучитьДвоичныеДанные();
		
		ЗаголовкиФайла = Новый Соответствие;
		ЗаголовкиФайла.Вставить("Content-Type", "multipart/form-data; boundary=" + ГраницаЧасти);
		ЗапросФайла = Новый HTTPЗапрос(ЧастиURL.ОтносительныйАдрес, ЗаголовкиФайла);
		ЗапросФайла.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
		Ответ = СоединениеФайла.ОтправитьДляОбработки(ЗапросФайла);
		
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(Ответ.ПолучитьТелоКакСтроку());
		Если СтруктураОтвета.Свойство("token") И ЗначениеЗаполнено(СтруктураОтвета.token) Тогда
			// Для image/file токен приходит только в ответе на загрузку файла.
			ТокенФайла = СтруктураОтвета.token;
		ИначеЕсли ЗначениеЗаполнено(ТокенИзОтветаНаЗагрузку) Тогда
			ТокенФайла = ТокенИзОтветаНаЗагрузку;
		ИначеЕсли СтруктураОтвета.Свойство("error") Тогда
			ВызватьИсключение СтруктураОтвета.error;
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.ЗагрузитьВложениеMAX",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось загрузить вложение <" + ИмяФайла + ">: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ТокенФайла;
	
КонецФункции

// Заполняет массив сообщений из обновлений MAX.
//
// Параметры:
//  УчетнаяЗапись   - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//  Обновления	   - Массив - Массив объектов Update.
//  МассивСообщений - Массив - Заполняемый массив сообщений.
//
Процедура ЗаполнитьСообщенияИзОбновлений(УчетнаяЗапись, Обновления, МассивСообщений)
	
	Для каждого Обновление Из Обновления Цикл
		Если Обновление.Свойство("update_type")
			И Обновление.update_type = "message_created"
			И Обновление.Свойство("message") Тогда
			Сообщение = СообщениеИзДанныхMAX(УчетнаяЗапись, Обновление.message);
			Если Сообщение <> Неопределено Тогда
				МассивСообщений.Добавить(Сообщение);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Преобразует объект Message из API MAX в структуру сообщения мессенджера.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//  ДанныеСообщения - Структура - Объект Message из API MAX.
//
// Возвращаемое значение:
//  Структура, Неопределено - Структура сообщения мессенджера.
//
Функция СообщениеИзДанныхMAX(УчетнаяЗапись, ДанныеСообщения)
	
	Если (Не ДанныеСообщения.Свойство("sender") Или ДанныеСообщения.sender = Неопределено)
		И (Не ДанныеСообщения.Свойство("recipient") Или ДанныеСообщения.recipient = Неопределено) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
	Если ДанныеСообщения.Свойство("timestamp") Тогда
		Сообщение.Дата = МестноеВремя(Дата(1970, 1, 1) + Число(ДанныеСообщения.timestamp) / 1000);
	КонецЕсли;
	
	ИмяПользователя = "";
	user_id = "";
	Если ДанныеСообщения.Свойство("sender") И ДанныеСообщения.sender <> Неопределено Тогда
		user_id = Формат(ДанныеСообщения.sender.user_id, "ЧГ=0");
		Если ДанныеСообщения.sender.Свойство("first_name") Тогда
			ИмяПользователя = ДанныеСообщения.sender.first_name;
		КонецЕсли;
		Если ДанныеСообщения.sender.Свойство("last_name") И ЗначениеЗаполнено(ДанныеСообщения.sender.last_name) Тогда
			ИмяПользователя = ИмяПользователя + " " + ДанныеСообщения.sender.last_name;
		КонецЕсли;
	КонецЕсли;
	
	chat_id = "";
	Если ДанныеСообщения.Свойство("recipient") И ДанныеСообщения.recipient <> Неопределено Тогда
		Если ДанныеСообщения.recipient.Свойство("chat_id") Тогда
			chat_id = Формат(ДанныеСообщения.recipient.chat_id, "ЧГ=0");
		КонецЕсли;
	КонецЕсли;
	
	Если ПустаяСтрока(user_id) И ПустаяСтрока(chat_id) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ПустаяСтрока(user_id) Тогда
		user_id = chat_id;
	КонецЕсли;
	
	Сообщение.ID_Пользователя = user_id;
	Сообщение.КонтактПредставление = ИмяПользователя;
	Сообщение.Группа = chat_id;
	Сообщение.ГруппаПредставление = chat_id;
	Сообщение.ВидСообщения = "Входящее";
	
	Если ДанныеСообщения.Свойство("body") И ДанныеСообщения.body <> Неопределено Тогда
		Если ДанныеСообщения.body.Свойство("mid") Тогда
			Сообщение.ID_Сообщения = ДанныеСообщения.body.mid;
		КонецЕсли;
		Если ДанныеСообщения.body.Свойство("text") Тогда
			Сообщение.ТекстСообщения = СтрЗаменить(ДанныеСообщения.body.text, "<br>", Символы.ПС);
		КонецЕсли;
		Если ДанныеСообщения.body.Свойство("attachments") И ДанныеСообщения.body.attachments.Количество() > 0 Тогда
			ЗаполнитьВложенияСообщения(Сообщение, ДанныеСообщения.body.attachments, УчетнаяЗапись);
		КонецЕсли;
	КонецЕсли;
	
	Если ДанныеСообщения.Свойство("link") И ДанныеСообщения.link <> Неопределено
		И ДанныеСообщения.link.Свойство("message") Тогда
		Если ДанныеСообщения.link.message.Свойство("body") И ДанныеСообщения.link.message.body.Свойство("mid") Тогда
			Сообщение.ID_СообщенияОснования = ДанныеСообщения.link.message.body.mid;
		КонецЕсли;
	КонецЕсли;
	
	Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(
		ПредставлениеКонтактнойИнформацииПользователя(user_id),
		УчетнаяЗапись, ТипКИМессенджера());
	Если ЗначениеЗаполнено(Контакт) Тогда
		Сообщение.Контакт = Контакт;
	КонецЕсли;
	
	Возврат Сообщение;
	
КонецФункции

// Заполняет вложения сообщения.
//
// Параметры:
//  Сообщение	 - Структура - Структура сообщения мессенджера.
//  Вложения	 - Массив - Массив вложений из API MAX.
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//
Процедура ЗаполнитьВложенияСообщения(Сообщение, Вложения, УчетнаяЗапись)
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	
	Для каждого Вложение Из Вложения Цикл
		Если Не Вложение.Свойство("type") Тогда
			Продолжить;
		КонецЕсли;
		
		ТипВложения = Вложение.type;
		Если ТипВложения = "inline_keyboard" Или ТипВложения = "location" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Вложение.Свойство("payload") Тогда
			Продолжить;
		КонецЕсли;
		
		АдресФайла = "";
		ИмяФайла = "";
		Если Вложение.payload.Свойство("url") Тогда
			АдресФайла = Вложение.payload.url;
		КонецЕсли;
		Если Вложение.payload.Свойство("filename") Тогда
			ИмяФайла = Вложение.payload.filename;
		КонецЕсли;
		Если Вложение.payload.Свойство("name") Тогда
			ИмяФайла = Вложение.payload.name;
		КонецЕсли;
		
		Если ПустаяСтрока(АдресФайла) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыФайла = СкачатьФайлMAX(АдресФайла, ИмяФайла, СтруктураПараметровДоступа);
		Если ПараметрыФайла <> Неопределено Тогда
			Сообщение.Вложения.Добавить(ПараметрыФайла);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Скачивает файл вложения по ссылке.
//
// Параметры:
//  АдресФайла - Строка - URL файла.
//  ИмяФайла  - Строка - Имя файла (может быть пустым).
//
// Возвращаемое значение:
//  Структура, Неопределено - Параметры файла.
//
Функция СкачатьФайлMAX(АдресФайла, ИмяФайла, СтруктураПараметровДоступа = Неопределено)
	
	ПараметрыФайла = Неопределено;
	
	Попытка
		ЧастиАдреса = РазбитьURL(АдресФайла);
		Хост = ЧастиАдреса.Хост;
		ОтносительныйАдрес = ЧастиАдреса.ОтносительныйАдрес;
		
		Соединение = Новый HTTPСоединение(Хост, , , , ПроксиМессенджера(СтруктураПараметровДоступа), 30,
			Новый ЗащищенноеСоединениеOpenSSL);
		ВебЗапрос = Новый HTTPЗапрос(ОтносительныйАдрес);
		Ответ = Соединение.Получить(ВебЗапрос);
		Если Ответ.КодСостояния = 200 Тогда
			Данные = Ответ.ПолучитьТелоКакДвоичныеДанные();
			Если ПустаяСтрока(ИмяФайла) Тогда
				ИмяФайла = Строка(Новый УникальныйИдентификатор());
			КонецЕсли;
			АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
			ПараметрыФайла = Новый Структура;
			ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
			ПараметрыФайла.Вставить("Автор", Неопределено);
			Если СтрНайти(ИмяФайла, ".") > 0 Тогда
				ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
				ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
			Иначе
				ПараметрыФайла.Вставить("ИмяБезРасширения", ИмяФайла);
				ПараметрыФайла.Вставить("РасширениеБезТочки", "");
			КонецЕсли;
			ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
			ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
			ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
		КонецЕсли;
	Исключение
		ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.СкачатьФайлMAX",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось скачать файл <" + АдресФайла + ">: " + ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ПараметрыФайла;
	
КонецФункции

// Разбивает URL на хост и относительный адрес.
//
// Параметры:
//  УРЛ - Строка - URL.
//
// Возвращаемое значение:
//  Структура - Структура с полями Хост и ОтносительныйАдрес.
//
Функция РазбитьURL(УРЛ)
	
	ЧастиУРЛ = СтрРазделить(УРЛ, "/", Ложь);
	Хост = "";
	Если ЧастиУРЛ.Количество() > 1 Тогда
		Хост = ЧастиУРЛ[1];
		Если Хост = "" И ЧастиУРЛ.Количество() > 2 Тогда
			Хост = ЧастиУРЛ[2];
		КонецЕсли;
	КонецЕсли;
	
	ЧастиБезПротокола = Новый Массив;
	Для Каждого Часть Из ЧастиУРЛ Цикл
		Если Часть = "http:" Или Часть = "https:" Или Часть = "" Или Часть = Хост Тогда
			Продолжить;
		КонецЕсли;
		ЧастиБезПротокола.Добавить(Часть);
	КонецЦикла;
	
	ОтносительныйАдрес = "/" + СтрСоединить(ЧастиБезПротокола, "/");
	Возврат Новый Структура("Хост, ОтносительныйАдрес", Хост, ОтносительныйАдрес);
	
КонецФункции

// Преобразует строку в двоичные данные в кодировке UTF-8 без BOM.
//
// Параметры:
//  СтрокаЗначения - Строка - Исходная строка.
//
// Возвращаемое значение:
//  ДвоичныеДанные - Байты строки.
//
Функция БуферВДвоичныеДанные(СтрокаЗначения)
	
	Возврат ПолучитьДвоичныеДанныеИзБуфераДвоичныхДанных(
		ПолучитьБуферДвоичныхДанныхИзСтроки(СтрокаЗначения, КодировкаТекста.UTF8, Ложь));
	
КонецФункции

// Возвращает URL метода API MAX.
//
// Параметры:
//  Метод - Строка - Имя метода.
//
// Возвращаемое значение:
//  Строка - Относительный путь метода.
//
Функция URLМетода(Метод)
	Возврат "/" + Метод;
КонецФункции

// Возвращает строку параметров запроса GET /updates (Long Polling).
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//
// Возвращаемое значение:
//  Строка - Строка параметров URL.
//
Функция ПараметрыОбновлений(УчетнаяЗапись)
	
	Параметры = Новый Массив;
	Параметры.Добавить("limit=200");
	Параметры.Добавить("timeout=25");
	Параметры.Добавить("types=message_created");
	
	Маркер = МаркерОбновлений(УчетнаяЗапись);
	Если ЗначениеЗаполнено(Маркер) Тогда
		Параметры.Добавить("marker=" + Маркер);
	КонецЕсли;
	
	Возврат "?" + СтрСоединить(Параметры, "&");
	
КонецФункции

// Возвращает сохраненный маркер обновлений Long Polling.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//
// Возвращаемое значение:
//  Строка - Значение маркера, пустая строка при отсутствии.
//
Функция МаркерОбновлений(УчетнаяЗапись)
	
	Значение = ХранилищеОбщихНастроек.Загрузить(КлючНастроекМаркера(УчетнаяЗапись), "");
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		Возврат Значение;
	КонецЕсли;
	Возврат "";
	
КонецФункции

// Сохраняет маркер обновлений из ответа GET /updates.
//
// Параметры:
//  УчетнаяЗапись   - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//  СтруктураОтвета - Структура - Разобранный ответ API MAX на GET /updates.
//
Процедура СохранитьМаркерОбновлений(УчетнаяЗапись, СтруктураОтвета)
	
	Если Не СтруктураОтвета.Свойство("marker") Или СтруктураОтвета.marker = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	ХранилищеОбщихНастроек.Сохранить(КлючНастроекМаркера(УчетнаяЗапись), "",
		Строка(СтруктураОтвета.marker));
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

// Возвращает ключ настроек для хранения маркера обновлений учетной записи.
//
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.CRM_УчетныеЗаписиМессенджеров - Учетная запись.
//
// Возвращаемое значение:
//  Строка - Ключ объекта в хранилище настроек.
//
Функция КлючНастроекМаркера(УчетнаяЗапись)
	
	Возврат "CRM_РаботаСМессенджеромMAX\МаркерОбновлений\" + Строка(УчетнаяЗапись.УникальныйИдентификатор());
	
КонецФункции

// Возвращает сервер API MAX.
//
// Возвращаемое значение:
//  Строка - Имя сервера.
//
Функция СерверMAX()
	Возврат "platform-api2.max.ru";
КонецФункции

// Возвращает тип вложения по расширению файла.
//
// Параметры:
//  ИмяФайла - Строка - Имя файла с расширением.
//
// Возвращаемое значение:
//  Строка - Тип вложения (image, video, audio, file).
//
Функция ТипВложенияПоРасширению(ИмяФайла)
	
	ПозицияТочки = СтрНайти(ИмяФайла, ".", НаправлениеПоиска.СКонца);
	Расширение = ?(ПозицияТочки > 0, НРег(Сред(ИмяФайла, ПозицияТочки + 1)), "");
	Если Расширение = "" Тогда
		Расширение = НРег(ИмяФайла);
	КонецЕсли;
	
	МассивИзображений = Новый Массив;
	МассивИзображений.Добавить("jpg");
	МассивИзображений.Добавить("jpeg");
	МассивИзображений.Добавить("png");
	МассивИзображений.Добавить("gif");
	МассивИзображений.Добавить("tiff");
	МассивИзображений.Добавить("bmp");
	МассивИзображений.Добавить("heic");
	Если МассивИзображений.Найти(Расширение) <> Неопределено Тогда
		Возврат "image";
	КонецЕсли;
	
	МассивВидео = Новый Массив;
	МассивВидео.Добавить("mp4");
	МассивВидео.Добавить("mov");
	МассивВидео.Добавить("mkv");
	МассивВидео.Добавить("webm");
	Если МассивВидео.Найти(Расширение) <> Неопределено Тогда
		Возврат "video";
	КонецЕсли;
	
	МассивАудио = Новый Массив;
	МассивАудио.Добавить("mp3");
	МассивАудио.Добавить("wav");
	МассивАудио.Добавить("m4a");
	МассивАудио.Добавить("ogg");
	Если МассивАудио.Найти(Расширение) <> Неопределено Тогда
		Возврат "audio";
	КонецЕсли;
	
	Возврат "file";
	
КонецФункции

// Возвращает текст ошибки из ответа сервера.
//
// Параметры:
//  ТекстОтвета - Строка - Текст ответа сервера.
//  КодСостояния - Число - Код состояния HTTP.
//
// Возвращаемое значение:
//  Строка - Текст ошибки в формате JSON.
//
Функция ПолучитьТекстОшибки(ТекстОтвета, КодСостояния)
	
	ОписаниеОшибки = "Ошибка HTTP " + Формат(КодСостояния, "ЧГ=0") + ": " + ТекстОтвета;
	СтруктураОшибки = Новый Структура("error", ОписаниеОшибки);
	Возврат CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(СтруктураОшибки);
	
КонецФункции

#Область GreenApi

Функция ПолучитьСообщенияGreen(УчетнаяЗапись, СтруктураПараметровДоступа)
	
	МассивСообщений = Новый Массив;
	ЗаполнитьСообщенияGreenПоОповещениям(УчетнаяЗапись, СтруктураПараметровДоступа, МассивСообщений);
	Возврат МассивСообщений;
	
КонецФункции

Процедура ОжиданиеСобытийGreen(УчетнаяЗапись, СтруктураПараметровДоступа)
	
	МассивСообщений = Новый Массив;
	ЗаполнитьСообщенияGreenПоОповещениям(УчетнаяЗапись, СтруктураПараметровДоступа, МассивСообщений);
	Если МассивСообщений.Количество() > 0 Тогда
		CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСообщенияGreenПоОповещениям(УчетнаяЗапись, СтруктураПараметровДоступа, МассивСообщений)
	
	Сервер = СерверGreen(СтруктураПараметровДоступа);
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен,
		"receiveNotification");
	Прокси = СтруктураПараметровДоступа.ПараметрыПрокси;
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(
		CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, "", Ресурс, Прокси, ""));
	
	Пока ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("body") Цикл
		
		idОповещения = Формат(СтруктураОтвета.receiptId, "ЧГ=0");
		Оповещение = СтруктураОтвета.body;
		Отказ = Ложь;
		
		ЭтоВходящее = (Оповещение.typeWebhook = "incomingMessageReceived");
		ЭтоИсходящее = (Оповещение.typeWebhook = "outgoingMessageReceived");
		
		Если ЭтоВходящее Или ЭтоИсходящее Тогда
			Сообщение = СообщениеИзОповещенияGreen(УчетнаяЗапись, Оповещение, ЭтоВходящее);
			Если Сообщение <> Неопределено Тогда
				МассивСообщений.Добавить(Сообщение);
			Иначе
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если Не Отказ Тогда
			АдресУдаления = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL,
				СтруктураПараметровДоступа.Токен, "deleteNotification") + "/" + idОповещения;
			Попытка
				CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, , АдресУдаления, Прокси, "", Истина);
			Исключение
				ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.GreenApi",
					УровеньЖурналаРегистрации.Ошибка, , ,
					ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				Если МассивСообщений.Количество() > 0 Тогда
					МассивСообщений.Удалить(МассивСообщений.ВГраница());
				КонецЕсли;
				Возврат;
			КонецПопытки;
		КонецЕсли;
		
		Попытка
			СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(
				CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, "", Ресурс, Прокси, ""));
		Исключение
			ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.GreenApi",
				УровеньЖурналаРегистрации.Ошибка, , ,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	Если ТипЗнч(СтруктураОтвета) = Тип("Структура") И СтруктураОтвета.Свойство("error")
		И ЗначениеЗаполнено(СтруктураОтвета.error) Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
КонецПроцедуры

Функция СообщениеИзОповещенияGreen(УчетнаяЗапись, Оповещение, ЭтоВходящее)
	
	Если Не Оповещение.Свойство("senderData") Или Не Оповещение.Свойство("messageData") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
	Если Оповещение.Свойство("timestamp") Тогда
		Сообщение.Дата = МестноеВремя(Дата(1970, 1, 1) + Оповещение.timestamp);
	КонецЕсли;
	
	Если ЭтоВходящее Тогда
		user_id = Строка(Оповещение.senderData.sender);
		Сообщение.ВидСообщения = "Входящее";
	Иначе
		user_id = Строка(Оповещение.senderData.chatId);
		Сообщение.ВидСообщения = "Исходящее";
	КонецЕсли;
	
	ИмяПользователя = "";
	Если Оповещение.senderData.Свойство("senderName") Тогда
		ИмяПользователя = Оповещение.senderData.senderName;
	КонецЕсли;
	
	Сообщение.ID_Сообщения = Оповещение.idMessage;
	Сообщение.ID_Пользователя = user_id;
	Сообщение.Группа = user_id;
	
	Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(
		ПредставлениеКонтактнойИнформацииПользователя(user_id),
		УчетнаяЗапись, ТипКИМессенджера());
	Если ЗначениеЗаполнено(Контакт) Тогда
		Сообщение.Контакт = Контакт;
	КонецЕсли;
	
	Если ЭтоВходящее Тогда
		Сообщение.КонтактПредставление = ИмяПользователя;
	ИначеЕсли ТипЗнч(Контакт) <> Тип("Строка") И ЗначениеЗаполнено(Контакт) Тогда
		Сообщение.КонтактПредставление = Строка(Контакт);
	Иначе
		Сообщение.КонтактПредставление = user_id;
	КонецЕсли;
	
	ЗаполнитьТекстИВложенияGreen(Сообщение, Оповещение.messageData);
	Возврат Сообщение;
	
КонецФункции

Процедура ЗаполнитьТекстИВложенияGreen(Сообщение, ДанныеСообщения)
	
	ТипСообщения = "";
	Если ДанныеСообщения.Свойство("typeMessage") Тогда
		ТипСообщения = ДанныеСообщения.typeMessage;
	КонецЕсли;
	
	Если ТипСообщения = "imageMessage"
		Или ТипСообщения = "videoMessage"
		Или ТипСообщения = "documentMessage"
		Или ТипСообщения = "audioMessage"
		Или ТипСообщения = "stickerMessage" Тогда
		
		ИмяФайла = "";
		Если ДанныеСообщения.Свойство("fileMessageData") Тогда
			Если ТипСообщения = "documentMessage" И ДанныеСообщения.fileMessageData.Свойство("fileName") Тогда
				ИмяФайла = ДанныеСообщения.fileMessageData.fileName;
			КонецЕсли;
			Если ДанныеСообщения.fileMessageData.Свойство("downloadUrl")
				И ЗначениеЗаполнено(ДанныеСообщения.fileMessageData.downloadUrl) Тогда
				ПараметрыФайла = СкачатьФайлПоСсылкеGreen(ДанныеСообщения.fileMessageData.downloadUrl, ИмяФайла);
				Если ПараметрыФайла <> Неопределено Тогда
					Сообщение.Вложения.Добавить(ПараметрыФайла);
				КонецЕсли;
				Если ДанныеСообщения.fileMessageData.Свойство("caption") Тогда
					Сообщение.ТекстСообщения = ДанныеСообщения.fileMessageData.caption;
				КонецЕсли;
			Иначе
				Сообщение.ТекстСообщения = НСтр("ru = 'Ошибка загрузки вложения! В сообщении отсутствует адрес файла.'");
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ДанныеСообщения.Свойство("textMessageData")
		И ДанныеСообщения.textMessageData.Свойство("textMessage") Тогда
		Сообщение.ТекстСообщения = ДанныеСообщения.textMessageData.textMessage;
		
	ИначеЕсли ДанныеСообщения.Свойство("extendedTextMessageData") Тогда
		ТемпТекст = "";
		Если ДанныеСообщения.extendedTextMessageData.Свойство("text") Тогда
			ТемпТекст = ДанныеСообщения.extendedTextMessageData.text;
		КонецЕсли;
		Сообщение.ТекстСообщения = ТемпТекст;
		
	Иначе
		Сообщение.ТекстСообщения = "";
	КонецЕсли;
	
КонецПроцедуры

Функция СкачатьФайлПоСсылкеGreen(АдресСсылки, ИмяФайла = "")
	
	Попытка
		ЧастиURL = РазбитьURL(АдресСсылки);
		Соединение = Новый HTTPСоединение(ЧастиURL.Хост, , , , , 60, Новый ЗащищенноеСоединениеOpenSSL);
		Ответ = Соединение.Получить(Новый HTTPЗапрос(ЧастиURL.ОтносительныйАдрес));
		Если Ответ.КодСостояния <> 200 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ИмяФайла) Тогда
			Позиция = СтрНайти(АдресСсылки, "/", НаправлениеПоиска.СКонца);
			ИмяФайла = ?(Позиция > 0, Сред(АдресСсылки, Позиция + 1), "file");
		КонецЕсли;
		
		ПараметрыФайла = Новый Структура;
		ПараметрыФайла.Вставить("ИмяБезРасширения", "");
		ПараметрыФайла.Вставить("РасширениеБезТочки", "");
		ФайлИнфо = Новый Файл(ИмяФайла);
		ПараметрыФайла.ИмяБезРасширения = ФайлИнфо.ИмяБезРасширения;
		ПараметрыФайла.РасширениеБезТочки = СтрЗаменить(ФайлИнфо.Расширение, ".", "");
		ПараметрыФайла.Вставить("АдресФайлаВХранилище",
			ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные()));
		Возврат ПараметрыФайла;
	Исключение
		ЗаписьЖурналаРегистрации("CRM_РаботаСМессенджеромMAX.GreenApi",
			УровеньЖурналаРегистрации.Предупреждение, , ,
			"Не удалось скачать файл: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция ОтправитьСообщениеGreen(Сообщение, УчетнаяЗапись, IDПользователя, СписокФайлов, СтруктураПараметровДоступа)
	
	chatId = Строка(IDПользователя);
	ИдСообщения = Неопределено;
	
	ЕстьФайлы = (СписокФайлов <> Неопределено И СписокФайлов.Количество() > 0);
	Если ЕстьФайлы Тогда
		Первый = Истина;
		Для Каждого Вложение Из СписокФайлов Цикл
			ДанныеВложения = Вложение.Значение;
			Если ТипЗнч(ДанныеВложения) <> Тип("ДвоичныеДанные") Тогда
				Продолжить;
			КонецЕсли;
			Подпись = ?(Первый, Сообщение, "");
			ИдСообщения = ОтправитьФайлGreen(chatId, ДанныеВложения, Вложение.Представление,
				Подпись, СтруктураПараметровДоступа);
			Первый = Ложь;
		КонецЦикла;
		Если Первый И ЗначениеЗаполнено(Сообщение) Тогда
			ИдСообщения = ОтправитьТекстGreen(chatId, Сообщение, СтруктураПараметровДоступа);
		КонецЕсли;
	Иначе
		ИдСообщения = ОтправитьТекстGreen(chatId, Сообщение, СтруктураПараметровДоступа);
	КонецЕсли;
	
	Возврат ИдСообщения;
	
КонецФункции

Функция ОтправитьТекстGreen(chatId, Текст, СтруктураПараметровДоступа)
	
	Сервер = СерверGreen(СтруктураПараметровДоступа);
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "sendMessage");
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("chatId", chatId);
	ДанныеЗапроса.Вставить("message", Текст);
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(ДанныеЗапроса, Истина);
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(
		CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, СтрокаЗапроса, Ресурс,
			СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	Если СтруктураОтвета.Свойство("idMessage") Тогда
		Возврат СтруктураОтвета.idMessage;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ОтправитьФайлGreen(chatId, Данные, ИмяФайла, Подпись, СтруктураПараметровДоступа)
	
	Сервер = СерверMediaGreen(СтруктураПараметровДоступа);
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен,
		"sendFileByUpload");
	
	Граница = "----SmartUTGreen" + Строка(Новый УникальныйИдентификатор());
	Тело = Новый ПотокВПамяти;
	Запись = Новый ЗаписьДанных(Тело);
	
	Запись.Записать(БуферВДвоичныеДанные("--" + Граница + Символы.ПС
		+ "Content-Disposition: form-data; name=""chatId""" + Символы.ПС + Символы.ПС
		+ chatId + Символы.ПС));
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		Запись.Записать(БуферВДвоичныеДанные("--" + Граница + Символы.ПС
			+ "Content-Disposition: form-data; name=""fileName""" + Символы.ПС + Символы.ПС
			+ ИмяФайла + Символы.ПС));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Подпись) Тогда
		Запись.Записать(БуферВДвоичныеДанные("--" + Граница + Символы.ПС
			+ "Content-Disposition: form-data; name=""caption""" + Символы.ПС + Символы.ПС
			+ Подпись + Символы.ПС));
	КонецЕсли;
	
	Запись.Записать(БуферВДвоичныеДанные("--" + Граница + Символы.ПС
		+ "Content-Disposition: form-data; name=""file""; filename=""" + ИмяФайла + """" + Символы.ПС
		+ "Content-Type: application/octet-stream" + Символы.ПС + Символы.ПС));
	Запись.Записать(Данные);
	Запись.Записать(БуферВДвоичныеДанные(Символы.ПС + "--" + Граница + "--" + Символы.ПС));
	Запись.Закрыть();
	ТелоЗапроса = Тело.ЗакрытьИПолучитьДвоичныеДанные();
	
	HTTPПрокси = ПроксиМессенджера(СтруктураПараметровДоступа);
	HTTP = Новый HTTPСоединение(Сервер, , , , HTTPПрокси, 120, Новый ЗащищенноеСоединениеOpenSSL);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "multipart/form-data; boundary=" + Граница);
	Запрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	Запрос.УстановитьТелоИзДвоичныхДанных(ТелоЗапроса);
	Ответ = HTTP.ОтправитьДляОбработки(Запрос);
	ТекстОтвета = Ответ.ПолучитьТелоКакСтроку();
	Если Ответ.КодСостояния <> 200 Тогда
		ВызватьИсключение "Ошибка HTTP " + Формат(Ответ.КодСостояния, "ЧГ=0") + ": " + ТекстОтвета;
	КонецЕсли;
	
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ТекстОтвета);
	Если СтруктураОтвета.Свойство("idMessage") Тогда
		Возврат СтруктураОтвета.idMessage;
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

Функция ОбработатьWebhookGreen(УчетнаяЗапись, ТелоЗапроса, СтруктураПараметровДоступа) Экспорт
	
	Оповещение = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(ТелоЗапроса);
	ЭтоВходящее = (Оповещение.typeWebhook = "incomingMessageReceived");
	ЭтоИсходящее = (Оповещение.typeWebhook = "outgoingMessageReceived");
	
	Если ЭтоВходящее Или ЭтоИсходящее Тогда
		МассивСообщений = Новый Массив;
		Сообщение = СообщениеИзОповещенияGreen(УчетнаяЗапись, Оповещение, ЭтоВходящее);
		Если Сообщение <> Неопределено Тогда
			МассивСообщений.Добавить(Сообщение);
			CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
		КонецЕсли;
	КонецЕсли;
	
	ДанныеОтвета = Новый Структура("status", "ок");
	Возврат CRM_РаботаСМессенджерамиСервер.HTTPОтвет(ДанныеОтвета);
	
КонецФункции

Функция УстановитьWebhookGreen(УчетнаяЗапись, СтруктураПараметровДоступа) Экспорт
	
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	АдресWebhook = "";
	Если СтруктураПараметровДоступа.Свойство("АдресWebhook")
		И ЗначениеЗаполнено(СтруктураПараметровДоступа.АдресWebhook) Тогда
		АдресWebhook = СтруктураПараметровДоступа.АдресWebhook;
		Если УчетнаяЗапись <> Неопределено Тогда
			АдресWebhook = АдресWebhook + ?(Прав(АдресWebhook, 1) = "/", "", "/")
				+ Строка(УчетнаяЗапись.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;
	
	СтруктураНастроек = Новый Структура;
	СтруктураНастроек.Вставить("webhookUrl", АдресWebhook);
	СтруктураНастроек.Вставить("incomingWebhook", "yes");
	СтруктураНастроек.Вставить("outgoingWebhook", "yes");
	СтруктураНастроек.Вставить("outgoingMessageWebhook", "yes");
	СтруктураНастроек.Вставить("stateWebhook", "yes");
	СтруктураНастроек.Вставить("markIncomingMessagesReaded", "no");
	
	СтрокаЗапроса = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(СтруктураНастроек, Истина);
	Сервер = СерверGreen(СтруктураПараметровДоступа);
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен, "setSettings");
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(
		CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, СтрокаЗапроса, Ресурс,
			СтруктураПараметровДоступа.ПараметрыПрокси));
	
	Если СтруктураОтвета.Свойство("saveSettings") Тогда
		Возврат СтруктураОтвета.saveSettings;
	КонецЕсли;
	
	ТекстОшибки = ?(СтруктураОтвета.Свойство("error"),
		"Не удалось сохранить настройки Green-API: " + СтруктураОтвета.error,
		"Не удалось сохранить настройки Green-API");
	ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
	Возврат Ложь;
	
КонецФункции

Функция ОтключитьсяGreen(СтруктураПараметровДоступа)
	
	СтруктураПараметровДоступа.Вставить("АдресWebhook", "");
	Возврат УстановитьWebhookGreen(Неопределено, СтруктураПараметровДоступа);
	
КонецФункции

Процедура ПроверитьПодключениеGreen(СтруктураПараметровДоступа)
	
	Сервер = СерверGreen(СтруктураПараметровДоступа);
	Ресурс = URLМетодаСервисаGreen(СтруктураПараметровДоступа.ApiURL, СтруктураПараметровДоступа.Токен,
		"getStateInstance");
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(
		CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос(Сервер, ,
			Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси));
	Если СтруктураОтвета.Свойство("error") Тогда
		ВызватьИсключение СтруктураОтвета.error;
	КонецЕсли;
	
КонецПроцедуры

Функция СерверGreen(СтруктураПараметровДоступа)
	
	Если СтруктураПараметровДоступа.Свойство("Сервер") И ЗначениеЗаполнено(СтруктураПараметровДоступа.Сервер) Тогда
		Возврат НормализоватьХостGreen(СтруктураПараметровДоступа.Сервер);
	КонецЕсли;
	Возврат "api.green-api.com";
	
КонецФункции

Функция СерверMediaGreen(СтруктураПараметровДоступа)
	
	Если СтруктураПараметровДоступа.Свойство("MediaURL") И ЗначениеЗаполнено(СтруктураПараметровДоступа.MediaURL) Тогда
		Возврат НормализоватьХостGreen(СтруктураПараметровДоступа.MediaURL);
	КонецЕсли;
	
	ХостAPI = СерверGreen(СтруктураПараметровДоступа);
	Возврат СтрЗаменить(ХостAPI, ".api.", ".media.");
	
КонецФункции

Функция НормализоватьХостGreen(Знач Хост)
	
	Хост = СокрЛП(Хост);
	Хост = СтрЗаменить(Хост, "https://", "");
	Хост = СтрЗаменить(Хост, "http://", "");
	Пока Прав(Хост, 1) = "/" Цикл
		Хост = Лев(Хост, СтрДлина(Хост) - 1);
	КонецЦикла;
	Возврат Хост;
	
КонецФункции

Функция URLМетодаСервисаGreen(Инстанс, Токен, Метод)
	
	Возврат СтрШаблон("waInstance%1/%2/%3", Инстанс, Метод, Токен);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
